// Записать условие, которое является истинным, когда:
// а) целое N кратно пяти или семи;
// б) целое N кратно четырем и не оканчивается нулем.
#include <iostream>
using namespace std;

int main() {
    int N;
    cout << "Введите целое число N: ";
    cin >> N;

    // а)
    if ((N % 5 == 0) || (N % 7 == 0)) {
        cout << "а) N кратно 5 или 7" << endl;
    }
    else {
        cout << "а) Условие не выполнено" << endl;
    }

    // б)
    if ((N % 4 == 0) && (N % 10 != 0)) {
        cout << "б) N кратно 4 и не оканчивается на 0" << endl;
    }
    else {
        cout << "б) Условие не выполнено" << endl;
    }

    return 0;
}
