// Определить, в какую из областей — I или II (рис. 4.1) — попадает точка с за-
// данными координатами. Для простоты принять, что точка не попадает на гра-
// ницу областей. (дана координатная плоскость, области: 1: x<4, 2: x>4)
#include <iostream>
using namespace std;

int main() {
    double x;

    cout << "Введите координату x: ";
    cin >> x;

    if (x < 4) {
        cout << "Точка находится в области I" << endl;
    } else {
        cout << "Точка находится в области II" << endl;
    }

    return 0;
}
