// Даны два различных вещественных числа. Определить:
// а) какое из них больше;
// б) какое из них меньше.
#include <iostream>
using namespace std;

int main() {
    double num1, num2;

    cout << "Введите первое число: ";
    cin >> num1;
    cout << "Введите второе число: ";
    cin >> num2;

    if (num1 == num2) {
        cout << "Ошибка: числа должны быть различными!" << endl;
        return 1;
    }

    if (num1 > num2) {
        cout << "Первое число (" << num1 << ") больше второго (" << num2 << ")" << endl;
        cout << "Второе число (" << num2 << ") меньше первого (" << num1 << ")" << endl;
    } else {
        cout << "Второе число (" << num2 << ") больше первого (" << num1 << ")" << endl;
        cout << "Первое число (" << num1 << ") меньше второго (" << num2 << ")" << endl;
    }

    return 0;
}
